Функция Данные(Ссылка,ИменаПолей) Экспорт
	Значение=Новый Структура(ИменаПолей);
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
				|	""Данные"" КАК Данные
				|ИЗ
				|	Справочник.Номенклатура КАК Номенклатура
				|ГДЕ
				|	Номенклатура.Ссылка = &Ссылка";
	ПодстрокаПоиска="""Данные"" КАК Данные";
	Запрос.Текст=СтрЗаменить(Запрос.Текст,ПодстрокаПоиска,ИменаПолей);
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Значение,Выборка);	
	КонецЕсли; 
	Возврат Значение;
КонецФункции // Данные()
 