
&НаКлиенте
Процедура ИФ_СписокПриАктивизацииСтрокиВместо(Элемент)
	Номенклатура=Элемент.ТекущаяСтрока;
	
	Если ЗначениеЗаполнено(Номенклатура) И Не Элемент.ТекущиеДанные.ЭтоГруппа Тогда
		Данные=ПодробнаяИнформация(Номенклатура,"Представление,ЭтоТовар");	
		Если Данные.ЭтоТовар Тогда
		   ТекстЗаголовка="Товар";
		Иначе
		    ТекстЗаголовка="Услуга";
		КонецЕсли; 
	    Элементы.Информация.ПоложениеЗаголовка=ПоложениеЗаголовкаЭлементаФормы.Нет;
		Информация=ТекстЗаголовка+": "+Данные.Представление;
	Иначе
	   Элементы.Информация.ПоложениеЗаголовка=ПоложениеЗаголовкаЭлементаФормы.Нет;
	   Информация="";
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура АФ_ИнформацияНажатиеВместо(Элемент, СтандартнаяОбработка)
	Состояние(Информация);
КонецПроцедуры
